In [1]:
import pandas as pd
from pandas import DataFrame

In [2]:
df = DataFrame

In [3]:
df = pd.read_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Data Wrangling\panel 3\Platform.csv")

In [4]:
df

       Unnamed: 0  Respondent PlatformDesireNextYear PlatformWorkedWith
0               0          10                Android            Android
1               1          10                    NaN              Linux
2               2          10                    NaN       Raspberry Pi
3               3          10                    NaN            Windows
4               4          10                  Linux                NaN
...           ...         ...                    ...                ...
34680       98989       64523        Microsoft Azure                NaN
34681       98992       64523                Windows                NaN
34682       98995       64938                 Docker             Docker
34683       98996       64938                    NaN              Linux
34684       98997       64938                  Linux                NaN

[34685 rows x 4 columns]

In [5]:
df.shape

(34685, 4)

In [6]:
df = df.drop_duplicates()

In [7]:
df

       Unnamed: 0  Respondent PlatformDesireNextYear PlatformWorkedWith
0               0          10                Android            Android
1               1          10                    NaN              Linux
2               2          10                    NaN       Raspberry Pi
3               3          10                    NaN            Windows
4               4          10                  Linux                NaN
...           ...         ...                    ...                ...
34680       98989       64523        Microsoft Azure                NaN
34681       98992       64523                Windows                NaN
34682       98995       64938                 Docker             Docker
34683       98996       64938                    NaN              Linux
34684       98997       64938                  Linux                NaN

[34685 rows x 4 columns]

In [8]:
import numpy as np

In [9]:
df.replace(np.nan, inplace = True)

Unnamed: 0                None
Respondent                None
PlatformDesireNextYear    None
PlatformWorkedWith        None
dtype: object

In [10]:
df

       Unnamed: 0  Respondent PlatformDesireNextYear PlatformWorkedWith
0               0          10                Android            Android
1               1          10                Android              Linux
2               2          10                Android       Raspberry Pi
3               3          10                Android            Windows
4               4          10                  Linux            Windows
...           ...         ...                    ...                ...
34680       98989       64523        Microsoft Azure          WordPress
34681       98992       64523                Windows          WordPress
34682       98995       64938                 Docker             Docker
34683       98996       64938                 Docker              Linux
34684       98997       64938                  Linux              Linux

[34685 rows x 4 columns]

In [11]:
missing_data = df.isnull()

In [12]:
missing_data.head(5)

   Unnamed: 0  Respondent  PlatformDesireNextYear  PlatformWorkedWith
0       False       False                   False               False
1       False       False                   False               False
2       False       False                   False               False
3       False       False                   False               False
4       False       False                   False               False

In [13]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

Unnamed: 0
False    34685
Name: Unnamed: 0, dtype: int64

Respondent
False    34685
Name: Respondent, dtype: int64

PlatformDesireNextYear
False    34685
Name: PlatformDesireNextYear, dtype: int64

PlatformWorkedWith
False    34685
Name: PlatformWorkedWith, dtype: int64

In [14]:
df.duplicated().sum()

0

In [15]:
df.isnull().sum()

Unnamed: 0                0
Respondent                0
PlatformDesireNextYear    0
PlatformWorkedWith        0
dtype: int64

In [16]:
df.dtypes

Unnamed: 0                 int64
Respondent                 int64
PlatformDesireNextYear    object
PlatformWorkedWith        object
dtype: object

In [17]:
df.to_csv(r"C:\Users\Sett's Wife\Desktop\Data Analysis\Certificates\IBM Data Analyst Professional Certificate edX\Course 9 Data Analytics and Visualization Capstone Project\Module 5 How to Present Your Findings\Data\New folder\Data Wrangling\panel 3\Platform 1.csv")

In [18]:
df

       Unnamed: 0  Respondent PlatformDesireNextYear PlatformWorkedWith
0               0          10                Android            Android
1               1          10                Android              Linux
2               2          10                Android       Raspberry Pi
3               3          10                Android            Windows
4               4          10                  Linux            Windows
...           ...         ...                    ...                ...
34680       98989       64523        Microsoft Azure          WordPress
34681       98992       64523                Windows          WordPress
34682       98995       64938                 Docker             Docker
34683       98996       64938                 Docker              Linux
34684       98997       64938                  Linux              Linux

[34685 rows x 4 columns]

In [20]:
df["PlatformWorkedWith"].value_counts()

Windows                        8313
iOS                            3793
Linux                          3708
WordPress                      3011
Docker                         2520
MacOS                          2419
AWS                            1906
Microsoft Azure                1775
Slack Apps and Integrations    1501
Raspberry Pi                   1417
Android                        1207
Kubernetes                      936
Google Cloud Platform           927
Heroku                          720
Arduino                         434
IBM Cloud or Watson              98
Name: PlatformWorkedWith, dtype: int64